using AnnouncementAPI.Helpers;
using EFDataAccessLibrary.Data;
using Microsoft.AspNetCore.Authorization;
using Microsoft.AspNetCore.Mvc;
using System;
using System.Collections.Generic;
using System.Threading.Tasks;

namespace AnnouncementAPI.Controllers
{
#if DEBUG

    [Route("api/[controller]")]
    [ApiController]
    public class Admin : ControllerBase
    {
        private readonly MyDbContext _context;

        public Admin(MyDbContext? context)
        {
            _context = context;
        }

        [HttpPost("PopulateDatabase")]
        public async Task<ActionResult<bool>> PopulateDatabase()
        {
            var toAdd = new List<object>();

            var admin = new User
            {
                FirstName = "Admin",
                LastName = "User",
                FullName = "Admin User",
                Email = "admin@mail.com",
            };
            toAdd.Add(admin);

            var secretary = new User
            {
                FirstName = "Undergraduate",
                LastName = "Secretary",
                FullName = "Simple User",
                Email = "secretary.undergraduate@ceid.upatras.gr",
            };
            toAdd.Add(secretary);

            var simpleUser = new User
            {
                FirstName = "Simple",
                LastName = "User",
                FullName = "Simple User",
                Email = "simple@ceid.upatras.gr",
            };
            toAdd.Add(simpleUser);

            var zaroliagis = new User
            {
                FirstName = "Χρήστος",
                LastName = "Ζαρολιάγκης",
                FullName = "Χρήστος Ζαρολιάγκης",
                Email = "zaro@ceid.upatras.gr",
            };
            toAdd.Add(zaroliagis);

            var georgoudakis = new User
            {
                FirstName = "Εμμανουήλ",
                LastName = "Γεωργουδάκης",
                FullName = "Εμμανουήλ Γεωργουδάκης",
                Email = "georgoudakis@ceid.upatras.gr",
            };
            toAdd.Add(georgoudakis);

            var komninos = new User
            {
                FirstName = "Ανδρέας",
                LastName = "Κομνηνός",
                FullName = "Ανδρέας Κομνηνός",
                Email = "akomninos@ceid.upatras.gr",
            };
            toAdd.Add(komninos);
                        

            var sioutas = new User
            {
                FirstName = "Σπύρος",
                LastName = "Σιούτας",
                FullName = "Σπύρος Σιούτας",
                Email = "sioutas@ceid.upatras.gr",
            };
            toAdd.Add(sioutas);

            var vergos = new User
            {
                FirstName = "Χαρίδημος",
                LastName = "Βέργος",
                FullName = "Χαρίδημος Βέργος",
                Email = "vergos@ceid.upatras.gr",
            };
            toAdd.Add(vergos);

            var tsixlas = new User
            {
                FirstName = "Κωσταντίνος",
                LastName = "Τσίχλας",
                FullName = "Κωσταντίνος Τσίχλας",
                Email = "ktsichlas@ceid.upatras.gr",
            };
            toAdd.Add(tsixlas);

            var galopoulos = new User
            {
                FirstName = "Ευστράτιος",
                LastName = "Γαλλόπουλος",
                FullName = "Ευστράτιος Γαλλόπουλος",
                Email = "stratis@ceid.upatras.gr",
            };
            toAdd.Add(galopoulos);

            var kosmopoulos = new User
            {
                FirstName = "Δημήτριος",
                LastName = "Κοσμόπουλος",
                FullName = "Δημήτριος Κοσμόπουλος",
                Email = "dkosmo@ceid.upatras.gr",
            };
            toAdd.Add(kosmopoulos);

            var category1 = new Category
            {
                Name = "Προπτυχιακό",
            };
            toAdd.Add(category1);

            var category2 = new Category
            {
                Name = "Μεταπτυχιακό",
            };
            toAdd.Add(category2);

            var category3 = new Category
            {
                Name = "Διπλωματικές",
            };
            toAdd.Add(category3);

            var subject1 = new Subject
            {
                Name = "Εισαγωγή στον Προγραμματισμό",
            };
            toAdd.Add(subject1);

            var subject2 = new Subject
            {
                Name = "Διακριτά Μαθηματικά",
            };
            toAdd.Add(subject2);

            var subject3 = new Subject
            {
                Name = "Γραμμική Άλγεβρα",
            };
            toAdd.Add(subject3);

            var subject4 = new Subject
            {
                Name = "Βασικές Αρχές Οργάνωσης και Λειτουργίας Υπολογιστικών Συστημάτων",
            };
            toAdd.Add(subject4);

            var subject5 = new Subject
            {
                Name = "Λογική Σχεδίαση",
            };
            toAdd.Add(subject5);

            var subject6 = new Subject
            {
                Name = "Ηλεκτρικά Κυκλώματα",
            };
            toAdd.Add(subject6);

            var subject7 = new Subject
            {
                Name = "Γενικά Μαθηματικά Ι",
            };
            toAdd.Add(subject7);

            var subject8 = new Subject
            {
                Name = "Αντικειμενοστρεφής Προγραμματισμός",
            };
            toAdd.Add(subject8);

            var subject9 = new Subject
            {
                Name = "Πιθανότητες και Αρχές Στατιστικής",
            };
            toAdd.Add(subject9);

            var subject10 = new Subject
            {
                Name = "Θεωρία Γραφημάτων και Εφαρμογές",
            };
            toAdd.Add(subject10);

            var subject11 = new Subject
            {
                Name = "Εργαστήριο Λογικού Σχεδιασμού",
            };
            toAdd.Add(subject11);

            var subject12 = new Subject
            {
                Name = "Εισαγωγή στους Αλγόριθμους",
            };
            toAdd.Add(subject12);

            var subject13 = new Subject
            {
                Name = "Γενικά Μαθηματικά ΙΙ",
            };
            toAdd.Add(subject13);

            var subject14 = new Subject
            {
                Name = "Αρχιτεκτονική Υπολογιστών",
            };
            toAdd.Add(subject14);

            var subject15 = new Subject
            {
                Name = "Θεωρία Σημάτων και Συστημάτων",
            };
            toAdd.Add(subject15);

            var subject16 = new Subject
            {
                Name = "Εργαστήριο Αρχιτεκτονικής Υπολογιστών",
            };
            toAdd.Add(subject16);

            var subject17 = new Subject
            {
                Name = "Δομές Δεδομένων",
            };
            toAdd.Add(subject17);

            var subject18 = new Subject
            {
                Name = "Αρχές Γλωσσών Προγραμματισμού και Μεταφραστών",
            };
            toAdd.Add(subject18);

            var subject19 = new Subject
            {
                Name = "Αριθμητική Ανάλυση και Περιβάλλοντα Υλοποίησης",
            };
            toAdd.Add(subject19);

            var subject20 = new Subject
            {
                Name = "Αναλογικά και Ψηφιακά Ηλεκτρονικά",
            };
            toAdd.Add(subject20);

            var subject21 = new Subject
            {
                Name = "Ψηφιακή Επεξεργασία Σημάτων",
            };
            toAdd.Add(subject21);

            var subject22 = new Subject
            {
                Name = "Τεχνητή Νοημοσύνη",
            };
            toAdd.Add(subject22);

            var subject23 = new Subject
            {
                Name = "Συστήματα Μικροϋπολογιστών",
            };
            toAdd.Add(subject23);

            var subject24 = new Subject
            {
                Name = "Λειτουργικά Συστήματα",
            };
            toAdd.Add(subject24);

            var subject25 = new Subject
            {
                Name = "Εργαστήριο Αναλογικών και Ψηφιακών Ηλεκτρονικών",
            };
            toAdd.Add(subject25);

            var subject26 = new Subject
            {
                Name = "Βάσεις Δεδομένων",
            };
            toAdd.Add(subject26);

            var subject27 = new Subject
            {
                Name = "Τεχνολογία Λογισμικού",
            };
            toAdd.Add(subject27);

            var subject28 = new Subject
            {
                Name = "Προγραμματισμός και Συστήματα στον Παγκόσμιο Ιστό",
            };
            toAdd.Add(subject28);

            var subject29 = new Subject
            {
                Name = "Θεωρία Υπολογισμού και Πολυπλοκότητα",
            };
            toAdd.Add(subject29);

            var subject30 = new Subject
            {
                Name = "Δίκτυα Υπολογιστών",
            };
            toAdd.Add(subject30);

            var subject31 = new Subject
            {
                Name = "Βασικές Έννοιες Συστημάτων Επικοινωνίας",
            };
            toAdd.Add(subject31);

            var subject32 = new Subject
            {
                Name = "Ψηφιακές Τηλεπικοινωνίες",
            };
            toAdd.Add(subject32);

            var subject33 = new Subject
            {
                Name = "Μικροϋπολογιστές",
            };
            toAdd.Add(subject33);

            var subject34 = new Subject
            {
                Name = "Επιστημονικός Υπολογισμός",
            };
            toAdd.Add(subject34);

            var subject35 = new Subject
            {
                Name = "Προηγμένοι Μικροεπεξεργαστές",
            };
            toAdd.Add(subject35);

            var subject36 = new Subject
            {
                Name = "Σχεδιασμός Συστημάτων Ειδικού Σκοπού",
            };
            toAdd.Add(subject36);

            var subject37 = new Subject
            {
                Name = "Παράλληλοι αλγόριθμοι",
            };
            toAdd.Add(subject37);

            var announcement1 = new Announcement
            {
                Id = 1,
                Title = "CEID Seminar & Social Hour: “Υβριδικές Μέθοδοι για Εξαγωγή Συμπερασμάτων Αβέβαιης Γνώσης – Αυτόματη Παραγωγή Κανόνων με Αβεβαιότητα από Δεδομένα”",
                Abstract = "Η λήψη αποφάσεων ή η δημιουργία προβλέψεων από δεδομένα μέσω μεθόδων μηχανικής μάθησης (ΜΜ) είναι από τα ερευνητικά θέματα υψηλού ενδιαφέροντος τα τελευταία χρόνια. Ένα μειονέκτημα των μεθόδων αυτών είναι η αδιαφάνεια στον τρόπο εξαγωγής αποτελεσμάτων, και ως εκ τούτου η αδυναμία παροχής επεξηγήσεων, διότι τα χρησιμοποιούμενα μοντέλα ΜΜ δεν το επιτρέπουν. Μια εναλλακτική είναι η δημιουργία μοντέλων που έχουν τέτοια δυνατότητα, όπως τα μοντέλα βασισμένα σε κανόνες (rule-based models) ή σε περιπτώσεις (case-based models). Επίσης, στα περισσότερα προβλήματα είτε υπάρχουν ελλιπή δεδομένα είτε η γνώση που παριστάνουν τα δεδομένα είναι εγγενώς αβέβαιη, καταστάσεις που πρέπει επίσης να αντιμετωπιστούν. Ένα άλλο (ενίοτε) μειονέκτημα των μοντέλων ΜΜ είναι η αναγκαιότητα ύπαρξης (ικανών) δεδομένων, τα οποία δεν είναι πάντα διαθέσιμα. Τα μοντέλα των κανόνων δεν έχουν αυτό το μειονέκτημα. Τέλος, έχει αποδειχθεί ότι ο κατάλληλος υβριδισμός μεθόδων σε ένα μοντέλο καταλήγει σε καλύτερα αποτελέσματα.\r\nΣτην ομιλία θα παρουσιαστούν μοντέλα και μέθοδοι που βασίζονται στις παραπάνω ερευνητικές κατευθύνσεις. Πιο συγκεκριμένα, στο πρώτο μέρος θα παρουσιαστεί ένα μοντέλο, ονόματι ACRES, που έχει σχεδιαστεί για να παράγει έμπειρα συστήματα βασισμένα σε κανόνες με ενσωματωμένο μοντέλο συντελεστών βεβαιότητας (certainty factors) από σύνολα δεδομένων. Το ACRES διαθέτει διάφορες μεθόδους εξαγωγής κανόνων και υπολογισμού των συντελεστών βεβαιότητας από δεδομένα, καθώς και ιεραρχικής οργάνωσης των κανόνων ώστε να διευκολύνεται η παροχή επεξηγήσεων. Η απόδοσή του συγκρίνεται με πολλές γνωστές μεθόδους ΜΜ.\r\nΣτο δεύτερο μέρος, θα παρουσιαστεί μια υβριδική μέθοδος συλλογισμού που ενσωματώνει την εξόρυξη διεργασιών (process mining) και τον συλλογισμό με κανόνες (rule-based reasoning) στο πλαίσιο του συλλογισμού με περιπτώσεις (case-based reasoning), η οποία εφαρμόστηκε σε ένα σύστημα εξατομικευμένης παροχής υπηρεσιών σε άτομα με διαταραχές του φάσματος του αυτισμού.",
                Body = "Ομιλητής: Κωνσταντίνος Κόβας, Υποψήφιος Διδάκτορας, ΤΜΗΥΠ\r\nΗμερομηνία-χώρος: Παρασκευή 25 Οκτωβρίου,  3-5μμ, ΤΜΗΥΠ, αίθουσα Ε2\r\nΠερίληψη: Η λήψη αποφάσεων ή η δημιουργία προβλέψεων από δεδομένα μέσω μεθόδων μηχανικής μάθησης (ΜΜ) είναι από τα ερευνητικά θέματα υψηλού ενδιαφέροντος τα τελευταία χρόνια. Ένα μειονέκτημα των μεθόδων αυτών είναι η αδιαφάνεια στον τρόπο εξαγωγής αποτελεσμάτων, και ως εκ τούτου η αδυναμία παροχής επεξηγήσεων, διότι τα χρησιμοποιούμενα μοντέλα ΜΜ δεν το επιτρέπουν. Μια εναλλακτική είναι η δημιουργία μοντέλων που έχουν τέτοια δυνατότητα, όπως τα μοντέλα βασισμένα σε κανόνες (rule-based models) ή σε περιπτώσεις (case-based models). Επίσης, στα περισσότερα προβλήματα είτε υπάρχουν ελλιπή δεδομένα είτε η γνώση που παριστάνουν τα δεδομένα είναι εγγενώς αβέβαιη, καταστάσεις που πρέπει επίσης να αντιμετωπιστούν. Ένα άλλο (ενίοτε) μειονέκτημα των μοντέλων ΜΜ είναι η αναγκαιότητα ύπαρξης (ικανών) δεδομένων, τα οποία δεν είναι πάντα διαθέσιμα. Τα μοντέλα των κανόνων δεν έχουν αυτό το μειονέκτημα. Τέλος, έχει αποδειχθεί ότι ο κατάλληλος υβριδισμός μεθόδων σε ένα μοντέλο καταλήγει σε καλύτερα αποτελέσματα.\r\nΣτην ομιλία θα παρουσιαστούν μοντέλα και μέθοδοι που βασίζονται στις παραπάνω ερευνητικές κατευθύνσεις. Πιο συγκεκριμένα, στο πρώτο μέρος θα παρουσιαστεί ένα μοντέλο, ονόματι ACRES, που έχει σχεδιαστεί για να παράγει έμπειρα συστήματα βασισμένα σε κανόνες με ενσωματωμένο μοντέλο συντελεστών βεβαιότητας (certainty factors) από σύνολα δεδομένων. Το ACRES διαθέτει διάφορες μεθόδους εξαγωγής κανόνων και υπολογισμού των συντελεστών βεβαιότητας από δεδομένα, καθώς και ιεραρχικής οργάνωσης των κανόνων ώστε να διευκολύνεται η παροχή επεξηγήσεων. Η απόδοσή του συγκρίνεται με πολλές γνωστές μεθόδους ΜΜ.\r\nΣτο δεύτερο μέρος, θα παρουσιαστεί μια υβριδική μέθοδος συλλογισμού που ενσωματώνει την εξόρυξη διεργασιών (process mining) και τον συλλογισμό με κανόνες (rule-based reasoning) στο πλαίσιο του συλλογισμού με περιπτώσεις (case-based reasoning), η οποία εφαρμόστηκε σε ένα σύστημα εξατομικευμένης παροχής υπηρεσιών σε άτομα με διαταραχές του φάσματος του αυτισμού.\r\nΣχετικά με τον ομιλητή:\r\nΟ Κωνσταντίνος Κόβας κατέχει Δίπλωμα Μηχανικού Ηλεκτρονικών Υπολογιστών και Πληροφορικής και Μεταπτυχιακό Δίπλωμα ειδίκευσης στην Επιστήμη και Τεχνολογία Υπολογιστών από το τμήμα Μηχανικών Η/Υ & Πληροφορικής του Πανεπιστημίου Πατρών. Αποτελεί υποψήφιο διδάκτορα στο ίδιο τμήμα, με ερευνητικά ενδιαφέροντα στην Τεχνητή Νοημοσύνη και πιο συγκεκριμένα: Έμπειρα Συστήματα, Συλλογισμό υπο Αβεβαιότητα, καθώς και Εκπαίδευση σε Εικονικά Περιβάλλοντα. Έχει δημοσιεύσει πάνω από 30 εργασίες σε διεθνή συνέδρια και περιοδικά. Έχει επίσης συμμετάσχει ως ερευνητής σε πολλά εθνικά και ευρωπαϊκά ερευνητικά προγράμματα και διαθέτει διδακτική εμπειρία στην Επαγγελματική και Τριτοβάθμια Εκπαίδευση. Από το 2016 εργάζεται ως μηχανικός λογισμικού στην εταιρεία Knowledge A.E.",
                CreatedTs = DateTime.Parse("2024-10-23 02:50:12.119000"),
                IsPublished = true,
                Creator = secretary,
                RelatedToCategories = new List<Category> { category1 },
                RelatedToSubjects = new List<Subject> {  }
            };

            var announcement2 = new Announcement
            {
                Id = 2,
                Title = "Υπενθύμιση: Προκήρυξη Εκλογών ανάδειξης εκπροσώπων των φοιτητών στη Συνέλευση του Τμήματος Μηχανικών Η/Υ & Πληροφορικής για θητεία από 1/1/2025-31/12/2025",
                Abstract = "Προκήρυξη εκλογών για την ανάδειξη των εκπροσώπων των φοιτητών των προγραμμάτων σπουδών πρώτου, δευτέρου και τρίτου κύκλου του Τμήματος Μηχανικών Ηλεκτρονικών...",
                Body = "Προκήρυξη εκλογών για την ανάδειξη των εκπροσώπων των φοιτητών των προγραμμάτων σπουδών πρώτου, δευτέρου και τρίτου κύκλου του Τμήματος Μηχανικών Ηλεκτρονικών Υπολογιστών και Πληροφορικής  της Πολυτεχνικής Σχολής του Πανεπιστημίου Πατρών και των αναπληρωτών τους στη Συνέλευση του Τμήματος για θητεία από 01-01-2025 έως και 31-12-2025.\r\n\r\nΗ εκλογική διαδικασία θα διενεργηθεί την Δευτέρα 11 Νοεμβρίου 2024  αποκλειστικά ηλεκτρονικά µε τη χρήση του ειδικού πληροφοριακού συστήµατος µε την ονοµασία «Ψηφιακή Κάλπη ΖΕΥΣ» της ανώνυμης εταιρείας του Ελληνικού Δηµοσίου µε την επωνυμία «Εθνικό Δίκτυο Υποδομών Τεχνολογίας και Έρευνας Α.Ε.» (Ε.Δ.Υ.Τ.Ε. Α.Ε.) και η ψηφοφορία θα διαρκέσει από  τις 9:00 έως  τις 15:00. \r\n\r\nΑπό την Γραμματεία\r\n\r\nΑΙΤΗΣΗ-ΥΠΟΨΗΦΙΟΤΗΤΑΣ",
                CreatedTs = DateTime.Parse("2024-08-02 00:05:11.143000"),
                IsPublished = true,
                Creator = admin,
                RelatedToCategories = new List<Category> { category1 },
                RelatedToSubjects = new List<Subject> { }
            };

            var announcement3 = new Announcement
            {
                Id = 3,
                Title = "ΕΝΑΡΞΗ ΔΗΛΩΣΗΣ ΚΑΙ ΔΙΑΝΟΜΗΣ ΔΙΔΑΚΤΙΚΩΝ ΣΥΓΓΡΑΜΜΑΤΩΝ ΧΕΙΜΕΡΙΝΟΥ ΕΞΑΜΗΝΟΥ ΑΚΑΔ. ΕΤΟΥΣ 2024-2025",
                Abstract = "Σύμφωνα με το έγγραφο (https://eudoxus.gr/Files/Dianomi_Xeimerinou_2024_25.pdf) του Υπουργείου Παιδείας, Θρησκευμάτων και Αθλητισμού, οι δηλώσεις συγγραμμάτων των φοιτητών θα ξεκινήσουν την Τρίτη 22 Οκτωβρίου 2024 και θα ολοκληρωθούν την Παρασκευή 20 Δεκεμβρίου 2024....",
                Body = "Σύμφωνα με το έγγραφο (https://eudoxus.gr/Files/Dianomi_Xeimerinou_2024_25.pdf) του Υπουργείου Παιδείας, Θρησκευμάτων και Αθλητισμού, οι δηλώσεις συγγραμμάτων των φοιτητών θα ξεκινήσουν την Τρίτη 22 Οκτωβρίου 2024 και θα ολοκληρωθούν την Παρασκευή 20 Δεκεμβρίου 2024.\r\n\r\nΗ διανομή συγγραμμάτων για το χειμερινό εξάμηνο θα ξεκινήσει την Τρίτη 22 Οκτωβρίου 2024 και θα ολοκληρωθεί την Τετάρτη 8 Ιανουαρίου 2025. \r\n\r\nΥπενθυμίζεται ότι οι φοιτητές δικαιούνται να προβούν σε δήλωση μαθημάτων και να παραλάβουν συγγράμματα μόνο για τα μαθήματα εκείνα τα οποία θα συμπεριλάβουν κατά το τρέχον εξάμηνο στη δήλωση μαθημάτων τους. Συγκεκριμένα, δεν δικαιούνται να παραλάβουν συγγράμματα για τα μαθήματα στα οποία έχουν εξετασθεί επιτυχώς, καθώς και για κατ’ επιλογήν μαθήματα που δεν συμπεριλαμβάνονται στη δήλωσή τους.\r\n\r\nΕπισημαίνεται ότι βάσει της ισχύουσας νομοθεσίας οι φοιτητές που έχουν υπερβεί τα ν+2 έτη σπουδών δεν δικαιούνται δωρεάν διδακτικά συγγράμματα.\r\n\r\nΓια περαιτέρω διευκρινίσεις ή απορίες μπορείτε να απευθύνεστε στο Γραφείο Αρωγής Χρηστών του Ευδόξου (https://eudoxus.gr/contact).",
                CreatedTs = DateTime.Parse("2024-08-02 00:14:03.669000"),
                IsPublished = true,
                Creator = secretary,
                RelatedToCategories = new List<Category> { category1 },
                RelatedToSubjects = new List<Subject> { }
            };

            var announcement4 = new Announcement
            {
                Id = 4,
                Title = "Προσφορά εργασίας – Συνεταιριστική Τράπεζα Ηπείρου",
                Abstract = "Η ΣΥΝΕΤΑΙΡΙΣΤΙΚΗ ΤΡΑΠΕΖΑ ΗΠΕΙΡΟΥ ΣΥΝ.Π.Ε. συνεχίζοντας την αναπτυξιακής της πορεία, βρίσκεται στην ευχάριστη θέση να απευθύνει πρόσκληση υποβολής βιογραφικών σημειωμάτων για την πλήρωση θέσης που θα καλύψει ανάγκες της Υποδιεύθυνσης Πληροφορικής, που υπάγεται στη Διεύθυνση Διοικητικής Λειτουργίας, Πληροφορικής και Οργάνωσης.  ...",
                Body = "ΠΡΟΚΗΡΥΞΗ ΠΡΟΣΛΗΨΗΣ ΠΡΟΣΩΠΙΚΟΥ\r\n\r\n \r\n\r\nΗ ΣΥΝΕΤΑΙΡΙΣΤΙΚΗ ΤΡΑΠΕΖΑ ΗΠΕΙΡΟΥ ΣΥΝ.Π.Ε. συνεχίζοντας την αναπτυξιακής της πορεία, βρίσκεται στην ευχάριστη θέση να απευθύνει πρόσκληση υποβολής βιογραφικών σημειωμάτων για την πλήρωση θέσης που θα καλύψει ανάγκες της Υποδιεύθυνσης Πληροφορικής, που υπάγεται στη Διεύθυνση Διοικητικής Λειτουργίας, Πληροφορικής και Οργάνωσης.  \r\n\r\nΤίτλος Θέσης:   JUNIOR DEVELOPER    (Προγραμματιστής Πληροφορικής)\r\n\r\n \r\n\r\nΠρόκειται για θέση πλήρους απασχόλησης με άμεσο Προϊστάμενο, τον Υποδιευθυντή της Διεύθυνσης Πληροφορικής.\r\n\r\n \r\n\r\nΤυπικά Προσόντα:\r\n\r\n \r\n\r\nΠτυχίο Μηχανικού H/Y – Πληροφορικής ή πτυχίο συναφούς κατεύθυνσης\r\nΝΕΤ / ASP.NET Core development experience (τουλάχιστον 3 έτη εμπειρία)\r\nΓνώση C# (ή VB.NET)\r\nΓνώση SQL – (ιδανικά working knowledge) TSQL (sql server development)\r\nΆριστη γνώση αγγλικών\r\nOμαδικό/συνεργατικό πνεύμα\r\nΕκπληρωμένες στρατιωτικές υποχρεώσεις (για τους άνδρες)\r\nΘα αξιολογηθούν ιδιαίτερα η επαγγελματική εμπειρία και η τεκμηρίωση γνώσεων σε βάσεις δεδομένων.\r\n \r\n\r\nΕνδεικτική Περιγραφή Καθηκόντων:\r\n\r\nΑνάπτυξη εφαρμογών σε τεχνολογίες που η Τράπεζα χρησιμοποιεί\r\nΠαρακολούθηση – ενημέρωση και χρήση νέων τεχνολογιών\r\nΔιαχείριση και παρακολούθηση καθημερινών ροών\r\nΕγκατάσταση εφαρμογών και διαχείριση χρηστών.\r\n \r\n\r\nΟι ενδιαφερόμενοι μπορούν να υποβάλουν βιογραφικό μαζί με το Έντυπο Προστασίας Προσωπικών Δεδομένων,\r\n\r\nμόνο ηλεκτρονικά, στην ακόλουθη διεύθυνση ηλεκτρονικού ταχυδρομείου: hr@epirusbank.gr\r\n\r\n \r\n\r\nΣυνεταιριστική Τράπεζα Ηπείρου Τμήμα Ανθρώπινου Δυναμικού\r\n\r\nΠληροφορίες www.epirusbank.gr",
                CreatedTs = DateTime.Parse("2024-08-05 07:48:22.378000"),
                IsPublished = true,
                Creator = georgoudakis,
                RelatedToCategories = new List<Category> { category1, category2 },
                RelatedToSubjects = new List<Subject> { }
            };

            var announcement5 = new Announcement
            {
                Id = 5,
                Title = "Πράξη Προέδρου του Τμήματος Μηχανικών Η/Υ & Πληροφορικής για την αδυναμία ολοκλήρωσης της εκλογικής διαδικασίας ανάδειξης εκπροσώπων των φοιτητών",
                Abstract = "",
                Body = "",
                CreatedTs = DateTime.Parse("2024 -10-23 02:50:12.119000"),
                IsPublished = true,
                Creator = secretary,
                RelatedToCategories = new List<Category> { category1 },
                RelatedToSubjects = new List<Subject> { }
            };

            var announcement6 = new Announcement
            {
                Id = 6,
                Title = "Σχεδιασμός Συστημάτων Ειδικού Σκοπού: Έναρξη διαλέξεων",
                Abstract = "Οι διαλέξεις του κατ’ επιλογήν μαθήματος “Σχεδιασμός Συστημάτων Ειδικού Σκοπού”, θα ξεκινήσουν την Πέμπτη 3/10.",
                Body = "O κ. Βέργος είναι Διπλωματούχος και Διδάκτορας του Τμήματος Μηχανικών Η/Υ & Πληροφορικής του Πανεπιστημίου Πατρών. Στη διδακτορική του διατριβή πρότεινε τρεις εναλλακτικές τεχνικές αντιμετώπισης ελαττωμάτων στις ενσωματωμένες κρυφές μνήμες, κάποιες εκ των οποίων βρίσκουν εμπορική εφαρμογή στα ολοκληρωμένα μικροεπεξεργαστών έως και σήμερα. Ακολούθως εργάστηκε ως σχεδιαστής υλικού για την εταιρεία Atmel. Ήταν μέλος της σχεδιαστικής μονάδας του πρώτου παγκοσμίως επεξεργαστή που υλοποιούσε πλήρως το MAC επίπεδο ασύρματων δικτύων κατά το πρότυπο 802.11, ενώ εργάστηκε και στην ανάπυξη άλλων ολοκληρωμένων για δικτυακές εφαρμογές. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν τις αρχιτεκτονικές αριθμητικών κυκλωμάτων, τη σχεδίαση και έλεγχο ορθής λειτουργίας ολοκληρωμένων κυκλωμάτων, τη γρήγορη πρωτοτυποποίηση με χρήση ολοκληρωμένων προγραμματιζόμενης λογικής και τη σταδιακή υποβάθμιση της απόδοσης για την αντιμετώπιση σφαλμάτων. Σε αυτά τα αντικείμενα έχει δημοσιεύσει πάνω από 95 εργασίες, με τουλάχιστον 10 εξ αυτών στα απολύτως κορυφαία περιοδικά του χώρου, ενώ είναι συνεφευρέτης μιας ιδέας κατοχυρωμένης για εμπορική χρήση με πατέντα παγκοσμίου εμβέλειας. Είναι επίσης κριτής σε σχεδόν όλα τα φημισμένα περιοδικά και συνέδρια του χώρου και υψηλού κύρους μέλος της IEEE. Κατά το τρέχων ακαδημαϊκό έτος διδάσκει τα μαθήματα \"Βασικές αρχές οργάνωσης και λειτουργίας υπολογιστικών συστημάτων\" και \"Σχεδίαση συστημάτων με χρήση υπολογιστών\" του προπτυχιακού προγράμματος. Επίσης διδάσκει το μάθημα \"Υπολογιστικά συστήματα υψηλής αξιοπιστίας\" τόσο για προπτυχιακούς όσο και μεταπτυχιακούς φοιτητές. Στο παρελθόν έχει διδάξει μαθήματα Ψηφιακής Σχεδίασης, Ηλεκτρονικών και Αρχιτεκτονικής, ενώ ήταν ο επιβλέπων της ανάπτυξης του ΑΤ91, ενός συστήματος βασισμένου σε αρχιτεκτονική ARM που χρησιμοποιείται έως και σήμερα στα εργαστήρια συμβολικής γλώσσας και μικροϋπολογιστών. Είναι Δντής του εργαστηρίου Μικροηλεκτρονικής. Έχει διατελέσει επίσης Δντής του τομέα Υλικού και Αρχιτεκτονικής των Υπολογιστών και του Υπολογιστικού Κέντρου του Τμήματος.",
                CreatedTs = DateTime.Parse("2024-08-02 00:05:11.143000"),
                IsPublished = true,
                Creator = vergos,
                RelatedToCategories = new List<Category> { category1 },
                RelatedToSubjects = new List<Subject> { subject36 }
            };

            var announcement7 = new Announcement
            {
                Id = 7,
                Title = "Παράλληλοι αλγόριθμοι (χειμερινό εξάμηνο 2024)",
                Abstract = "Η εναρκτήρια συνάντηση για το μάθημα θα πραγματοποιηθεί την Τρίτη, 8 Οκτωβρίου, ώρα έναρξης 18.00 στην αίθουσα Δ1. Εν τω μεταξύ, μπορείτε να δείτε πληροφορίες για αντικείμενο/σύγγραμμα στο website του μαθήματος και πληροφορίες για όρους/προϋποθέσεις στο αντίστοιχο eclass profile (με εγγραφή).",
                Body = "Η εναρκτήρια συνάντηση για το μάθημα θα πραγματοποιηθεί την Τρίτη, 8 Οκτωβρίου, ώρα έναρξης 18.00 στην αίθουσα Δ1. Εν τω μεταξύ, μπορείτε να δείτε πληροφορίες για αντικείμενο/σύγγραμμα στο website του μαθήματος και πληροφορίες για όρους/προϋποθέσεις στο αντίστοιχο eclass profile (με εγγραφή).",
                CreatedTs = DateTime.Parse("2024-10-02 00:14:03.669000"),
                IsPublished = true,
                Creator = secretary,
                RelatedToCategories = new List<Category> { category1 },
                RelatedToSubjects = new List<Subject> { subject37 }
            };

            var announcement8 = new Announcement
            {
                Id = 8,
                Title = "Παράταση 2ης φάσης ηλεκτρονικής εγγραφής πρωτοετών φοιτητών\r\n",
                Abstract = "",
                Body = "Θα θέλαμε να σας ενημερώσουμε ότι η 2η φάση ηλεκτρονικής εγγραφής για τους πρωτοετείς φοιτητές πήρε παράταση μέχρι και τις 4 Οκτωβρίου 2024\r\n\r\nΠαράταση ΔΕΕ – Εγγραφή Πρωτοετών_final_ημερομηνίες ΥΠΑΙΘΑ-upatras\r\n\r\nΑπό την Γραμματεία",
                CreatedTs = DateTime.Parse("2024-08-05 07:48:22.378000"),
                IsPublished = true,
                Creator = secretary,
                RelatedToCategories = new List<Category> { category1, category2 },
                RelatedToSubjects = new List<Subject> { }
            };

            var announcement9 = new Announcement
            {
                Id = 9,
                Title = "Εγγραφές πρωτοετών με τις ειδικές κατηγορίες των τέκνων Ελλήνων του Εξωτερικού, των τέκνων Ελλήνων υπαλλήλων που υπηρετούν στο εξωτερικό και των Ελλήνων αποφοίτων ξένων λυκείων του εξωτερικού, για το ακαδημαϊκό έτος 2024-2025.",
                Abstract = "Θα θέλαμε να σας ενημερώσουμε ότι οι εγγραφές πρωτοετών με τις ειδικές κατηγορίες των τέκνων Ελλήνων του Εξωτερικού, των τέκνων Ελλήνων υπαλλήλων που υπηρετούν στο εξωτερικό και των Ελλήνων αποφοίτων ξένων λυκείων του εξωτερικού, για το ακαδημαϊκό έτος 2024-2025, είναι από 03-10-2024 μέχρι και 10-10-2024.\r\n\r\nΛεπτομέρειες μπορείτε να βρείτε στην παρακάτω συνημμένη εγκύκλιο.\r\n\r\nΑπό την Γραμματεία\r\n\r\nΕγκύκλιο δικαιολογητικών για εγγραφή Ομογενών 2024-25\r\n\r\nΚΥΡΩΣΗ ΠΙΝΑΚΩΝ ΟΜΟΓΕΝΩΝ_2024",
                Body = "Θα θέλαμε να σας ενημερώσουμε ότι οι εγγραφές πρωτοετών με τις ειδικές κατηγορίες των τέκνων Ελλήνων του Εξωτερικού, των τέκνων Ελλήνων υπαλλήλων που υπηρετούν στο εξωτερικό και των Ελλήνων αποφοίτων ξένων λυκείων του εξωτερικού, για το ακαδημαϊκό έτος 2024-2025, είναι από 03-10-2024 μέχρι και 10-10-2024.\r\n\r\nΛεπτομέρειες μπορείτε να βρείτε στην παρακάτω συνημμένη εγκύκλιο.\r\n\r\nΑπό την Γραμματεία\r\n\r\nΕγκύκλιο δικαιολογητικών για εγγραφή Ομογενών 2024-25\r\n\r\nΚΥΡΩΣΗ ΠΙΝΑΚΩΝ ΟΜΟΓΕΝΩΝ_2024",
                CreatedTs = DateTime.Parse("2024-10-23 02:50:12.119000"),
                IsPublished = true,
                Creator = secretary,
                RelatedToCategories = new List<Category> { category1 },
                RelatedToSubjects = new List<Subject> { }
            };

            var announcement10 = new Announcement
            {
                Id = 10,
                Title = "Λογαριασμοί υπηρεσιών Τμήματος για πρωτοετείς φοιτητές 2024-25\r\n",
                Abstract = "ι λογαριασμοί για τις υπηρεσίες του Τμήματος ΜΟΝΟ ΣΕ ΟΣΟΥΣ ΕΓΓΡΑΦΗΚΑΝ ΓΙΑ ΠΡΩΤΗ ΦΟΡΑ ΤΟ ΣΕΠΤΕΜΒΡΙΟ 2024 έχουν σταλεί στο mail τους στο ac.upatras.gr .  Όσοι είναι πρωτοετείς αλλά εγγράφησαν ΠΡΙΝ το Σεπτέμβριο του 2024 ή όσοι δεν έχουν κάνει ήδη χρήση του λογαριασμού τους ως τώρα, έχουν ήδη λάβει τα στοιχεία του λογαριασμού τους στο mail...",
                Body = "Οι λογαριασμοί για τις υπηρεσίες του Τμήματος ΜΟΝΟ ΣΕ ΟΣΟΥΣ ΕΓΓΡΑΦΗΚΑΝ ΓΙΑ ΠΡΩΤΗ ΦΟΡΑ ΤΟ ΣΕΠΤΕΜΒΡΙΟ 2024 έχουν σταλεί στο mail τους στο ac.upatras.gr .  Όσοι είναι πρωτοετείς αλλά εγγράφησαν ΠΡΙΝ το Σεπτέμβριο του 2024 ή όσοι δεν έχουν κάνει ήδη χρήση του λογαριασμού τους ως τώρα, έχουν ήδη λάβει τα στοιχεία του λογαριασμού τους στο mail τους στο ac.upatras.gr όταν εγγράφησαν στο Τμήμα.\r\n\r\nΌσοι πρωτοετείς φοιτητές ΔΕΝ έλαβαν το λογαριασμό τους και τις οδηγίες χρήσης στο ιδρυματικό mail (ac.upatras.gr) να στείλουν mail με το ονοματεπώνυμό τους και το ΑΜ τους στο support@ceid.upatras.gr\r\n\r\nΥπενθυμίζουμε ότι όλοι οι χρήστες υπηρεσιών του Τμήματος θα πρέπει να έχουν ορίσει mail ανάκτησης κωδικού ώστε αν ξεχάσουν / χάσουν τον κωδικό του λογαριασμού CEID να μπορούν να ανακτήσουν πρόσβαση. Επίσης να διαβάσουν τους Κανόνες Τεχνικής Υποστήριξης .\r\n\r\n \r\n\r\nΕκ του Υπολογιστικού Κέντρου",
                CreatedTs = DateTime.Parse("2024-08-02 00:05:11.143000"),
                IsPublished = true,
                Creator = secretary,
                RelatedToCategories = new List<Category> { category1 },
                RelatedToSubjects = new List<Subject> { }
            };

            var announcement11 = new Announcement
            {
                Id = 11,
                Title = "Welcome to UP 2024: Ο Μητροπολίτη Πατρών υποδέχεται φοιτητές στον Ιερό Ναό του Αγίου Ανδρέα",
                Abstract = "Το Welcome to UP 2024 επισκέπτεται τον μεγαλύτερο ορθόδοξο ναό στην Ελλάδα και έναν\r\nαπό τους μεγαλύτερους στα Βαλκάνια, τον Ιερό Ναό του Πολιούχου της Πάτρας, Αποστόλου\r\nΑνδρέα.\r\nTην Τετάρτη 16 Οκτωβρίου, από 13.00- 15.00, οι πρωτοετείς φοιτητές του Πανεπιστημίου\r\nΠατρών θα έχουν την ευκαιρία να ξεναγηθούν στον Ιερό Ναό που αποτελεί χώρο\r\nπροσκυνήματος για χριστιανούς από όλο τον κόσμο και σήμα κατατεθέν της πόλης της\r\nΠάτρας...",
                Body = "Το Welcome to UP 2024 επισκέπτεται τον μεγαλύτερο ορθόδοξο ναό στην Ελλάδα και έναν\r\nαπό τους μεγαλύτερους στα Βαλκάνια, τον Ιερό Ναό του Πολιούχου της Πάτρας, Αποστόλου\r\nΑνδρέα.\r\nTην Τετάρτη 16 Οκτωβρίου, από 13.00- 15.00, οι πρωτοετείς φοιτητές του Πανεπιστημίου\r\nΠατρών θα έχουν την ευκαιρία να ξεναγηθούν στον Ιερό Ναό που αποτελεί χώρο\r\nπροσκυνήματος για χριστιανούς από όλο τον κόσμο και σήμα κατατεθέν της πόλης της\r\nΠάτρας.\r\nΤους φοιτητές θα υποδεχθεί ο σεβασμιότατος Μητροπολίτης Πατρών κ.κ. Χρυσόστομος.\r\n\r\nΟ Ιερός Ναός του Αποστόλου Ανδρέα, είναι βυζαντινού ρυθμού και η ανέγερσή του ξεκίνησε\r\nτο 1908 υπό την επίβλεψη του αρχιτέκτονα Αναστασίου Μεταξά, τον οποίο ακολούθησε ο\r\nΓεώργιος Νομικός. Εγκαινιάστηκε 66 χρόνια αργότερα, το 1974. Καλύπτει εμβαδόν περίπου\r\n2.600 τετραγωνικών μέτρων. Το εσωτερικό του ναού είναι διακοσμημένο με βυζαντινής\r\nτεχνοτροπίας τοιχογραφίες και μωσαϊκά.\r\nΗ αναχώρηση του λεωφορείου για την ξενάγηση στον Άγιο Ανδρέα, θα γίνει από την\r\nΠρυτανεία.\r\nΠληροφορίες για δρομολόγια και κρατήσεις θέσεων, στο\r\nhttps://welcometoup.upatras.gr/bus-tours-2024/\r\nTo Welcome to UP διοργανώνεται από το Πανεπιστήμιο Πατρών σε συνδιοργάνωση με την\r\nΠεριφέρεια Δυτικής Ελλάδας και το Επιμελητήριο Αχαΐας, σε συνεργασία με τους Δήμους\r\nΠατρέων, Αγρινίου και Μεσολογγίου και με την χρηματοδότηση του Υπουργείου Πολιτισμού.\r\nΌλα όσα θέλετε να μάθετε για το Φεστιβάλ Υποδοχής Πρωτοετών Φοιτητών του\r\nΠανεπιστημίου Πατρών: https\r\nΗ ΔΕΗ είναι Χρυσός Χορηγός του Welcome to UP 2024, δίνοντας ενέργεια\r\nαποκλειστικά για φοιτητές και φουλ παροχές!\r\n\r\nΠερισσότερα στο ΔΕΗ\r\nmyHome 4Students",
                CreatedTs = DateTime.Parse("2024-08-02 00:14:03.669000"),
                IsPublished = true,
                Creator = secretary,
                RelatedToCategories = new List<Category> { category1 },
                RelatedToSubjects = new List<Subject> { }
            };

            var announcement12 = new Announcement
            {
                Id = 12,
                Title = "Παρουσίαση διπλωματικής εργασίας\r\n",
                Abstract = "",
                Body = "Την Πέμπτη, 10 Οκτωβρίου 2024 και ώρα 13:10\r\n\r\nθα γίνει η παρουσίαση της διπλωματικής εργασίας του φοιτητή του Προγράμματος Προπτυχιακών Σπουδών του Τμήματος Μηχανικών Η/Υ και Πληροφορικής\r\n\r\nΔιονύσιου Καπελλέ (ΑΜ: 1067479)\r\n\r\nμε θέμα: “Διόρθωση κειμένων με χρήση τεχνικών ενσωμάτωσης φυσικής γλώσσας“\r\n\r\nστο σύνδεσμο: https://upatras-gr.zoom.us/j/3728297241?pwd=RkZhT3RmUk0rdG15WDBKMG51U1hDZz09\r\n\r\n\r\nΤριμελής Επιτροπή:\r\n\r\nΔ. Κουτσομητρόπουλος, μέλος ΕΔΙΠ (επιβλέπων)\r\n\r\nΧ. Μακρής, Αν. Καθηγητής\r\n\r\nΣ. Σιούτας, Καθηγητής",
                CreatedTs = DateTime.Parse("2024-08-05 07:48:22.378000"),
                IsPublished = true,
                Creator = georgoudakis,
                RelatedToCategories = new List<Category> { category1, category2 },
                RelatedToSubjects = new List<Subject> { }
            };

            var announcement13 = new Announcement
            {
                Id = 13,
                Title = "Πράξη Προέδρου του Τμήματος Μηχανικών Η/Υ & Πληροφορικής για την αδυναμία ολοκλήρωσης της εκλογικής διαδικασίας ανάδειξης εκπροσώπων των φοιτητών",
                Abstract = "",
                Body = "",
                CreatedTs = DateTime.Parse("2024 -10-23 02:50:12.119000"),
                IsPublished = true,
                Creator = secretary,
                RelatedToCategories = new List<Category> { category1 },
                RelatedToSubjects = new List<Subject> { }
            };

            var announcement14 = new Announcement
            {
                Id = 14,
                Title = "Welcome to UP 2024 και Τaste The City: Ειδικές προσφορές για πρωτοετείς φοιτητές σε καταστήματα εστίασης, με το… πάσο τους",
                Abstract = "Το Welcome to Up 2024 συστήνει στους πρωτοετείς φοιτητές του Πανεπιστημίου Πατρών τη\r\n«γεύση» της πόλης, με ειδικές προσφορές σε καταστήματα εστίασης και αναψυχής, που\r\nτους καλωσορίζουν με ενθουσιασμό στον τόπο, όπου θα περάσουν τα φοιτητικά τους\r\nχρόνια...",
                Body = "Το Welcome to Up 2024 συστήνει στους πρωτοετείς φοιτητές του Πανεπιστημίου Πατρών τη\r\n«γεύση» της πόλης, με ειδικές προσφορές σε καταστήματα εστίασης και αναψυχής, που\r\nτους καλωσορίζουν με ενθουσιασμό στον τόπο, όπου θα περάσουν τα φοιτητικά τους\r\nχρόνια.\r\nΣε συνεργασία με τον ΣΚΕΑΝΑ (Σύλλογο Καταστηματαρχών Εστίασης και Αναψυχής Νομού\r\nΑχαΐας), για τρίτη χρονιά, εστιατόρια, fast foods, καφέ, bars της Πάτρας, καλωσορίζουν τους\r\nφοιτητές με ειδικές τιμές κατά τη διάρκεια του πενθημέρου, με την επίδειξη του φοιτητικού\r\nπάσο! Οι επιχειρήσεις που συμμετέχουν στη δράση αποκτούν ειδικό σήμα με QR Code που\r\nπεριλαμβάνει όλο τον κατάλογο των καταστημάτων που συμμετέχουν στη δράση.\r\nΤα συνεργαζόμενα με το welcome to Up 2024 καταστήματα για το Taste the City είναι τα\r\nεξής:\r\nΟΝΟΜΑ ΚΑΤΑΣΤΗΜΑΤΟΣ\r\n• BIANCO ΡΗΓΑ ΦΕΡΑΙΟΥ 148 ΚΑΤΣΙΝΑΣ ΓΙΩΡΓΟΣ\r\n• ΤΡΙΩΝ ΤΡΙΩΝ ΝΑΥΑΡΧΩΝ 42ΑΡΗΣ ΣΤΑΜΑΤΟΓΛΟΥ\r\n• OLYMPICO ΓΟΡΓΟΠΟΤΑΜΟΥ 1, ΡΙΟΝ ΧΡΥΣΑΝΘΟΠΟΥΛΟΣ\r\n• PACHUCO ΒΟΥΡΒΑΧΗ ΑΛΈΞΗΣ ΣΤΑΘΑΣ\r\n• PLAYHOUSE ΡΗΓΑ ΦΕΡΑΙΟΥ 123 ΒΑΣΙΛΑΚΟΠΟΥΛΟΣ ΓΙΑΝΝΗΣ\r\n• BOCAS ΡΗΓΑ ΦΕΡΑΙΟΥ 39 ΒΑΣΙΛΑΚΟΠΟΥΛΟΣ ΓΙΑΝΝΗΣ\r\n• HALL CAFE ΜΕΓΑΛΟΥ ΑΛΕΞΑΝΔΡΟΥ 229 ΑΛΕΞΗΣ ΚΕΦΑΛΆΣ\r\n• ΠΙΤΣΙ ΚΑΝΑΚΑΡΗ 184 ΘΕΟΔΩΡΟΣ ΚΑΣΣΙΑΝΟΣ\r\n• ΥΠΟΒΡΥΧΙΟ ΒΑΝΙΛΙΑ ΠΛ.ΜΑΡΚΑΤΟΥ ΣΟΙΛΕΜΕΤΖΙΔΗΣ ΤΑΚΗΣ\r\n• TAG ΚΑΦΕ ΑΓΙΟΥ ΑΝΔΡΕΟΥ 127 Σπύρος Κορδής\r\n• LA BODEGUETA ΠΑΝΤΑΝΑΣΣΗΣ 3 ΤΣΙΓΚΙΛΑΡΑΣ ΑΝΔΡΕΑΣ ΓΕΩΡΓΙΟΣ\r\n• VOUKAMVILIA ΗΦΑΙΣΤΟΥ 22 ΤΣΙΓΚΙΛΑΡΑΣ ΑΝΔΡΕΑΣ ΓΕΩΡΓΙΟΣ\r\n• ΠΕΤΡΙΝΟ ΣΕΛΛΑ ΜΠΑΛΑΣΟΠΟΥΛΟΣ (ΚΩΣΤΑΣ)\r\n• Ο ΜΥΛΟΣ-ΠΕΤΡΙΝΟ ΜΑΓΕΙΡΙΟ ΜΑΙΖΩΝΟΣ 25 ΜΠΑΛΑΣΟΠΟΥΛΟΣ (ΚΩΣΤΑΣ)\r\n• BODEGAS ΡΗΓΑ ΦΕΡΑΙΟΥ 145 ΓΙΩΡΓΟΣ ΚΟΥΛΗΣ\r\n• ΜΠΑΧΑΡΙ ΤΡΙΩΝ ΝΑΥΑΡΧΩΝ 66 ΜΑΚΗΣ ΠΑΠΑΙΩΑΝΝΟΥ\r\n• DECK-ΚΑΛΥΨΩ ΗΡ.ΠΟΛΥΤΕΧΝΕΙΟΥ 42 ΚΑΤΙΑ ΛΟΗ\r\n• PEPPER KITCHEN BAR ΠΟΥΚΕΒΙΛ 5 ΓΙΩΡΓΟΣ ΚΟΝΤΟΓΙΑΝΝΗΣ\r\n• ΚΑΦΕΚΟΠΤΕΙΑ ΜΕΞΙΚΑΝΟΣ ΚΟΡΙΝΘΟΥ 453- ΑΓΙΟΥ ΚΩΝΣΤΑΝΤΙΝΟΥ 79\r\nΡΑΜΑΝΤΑΝΗΣ ΘΕΟΔΩΡΟΣ\r\n• POTATO KING ΓΕΡΟΚΩΣΤΟΠΟΥΛΟΥ 36Α ΣΕΙΜΕΝΗΣ ΕΥΣΤΡΑΤΙΟΣ\r\n• Ο ΟΝΤΑΣ ΠΑΡΘΕΝΙΟΥ 31 ΣΩΚΡΑΤΗΣ ΑΠΟΣΤΟΛΑΚΗΣ\r\n• PORTO FINO ΕΛΛ.ΣΤΡΑΤΙΩΤΗ 13 Γιατρας Τάσος\r\n• ΑΙΝΟΣ ΚΟΛΟΚΟΤΡΩΝΗ 24 ΘΕΟΔΩΡΟΣ ΚΩΝΣΤΑΝΤΑΤΟΣ\r\n• ΦΑΣΟΛΟΙ ΚΟΛΟΚΟΤΡΩΝΗ 55 ΣΠΥΡΟΣ ΜΠΥΡΑΤΣΗΣ\r\n• ΦΑΣΟΛΟΙ ΑΘΗΝΩΝ 1-5 ΣΠΥΡΟΣ ΜΠΥΡΑΤΣΗΣ\r\n• ΦΑΣΟΛΟΙ ΝΈΟ ΛΙΜΑΝΙ ΠΑΤΡΩΝ ΣΠΥΡΟΣ ΜΠΙΡΑΤΣΗΣ\r\n• RUBIK’S SUPERFOOD AND COFFEE ΠΑΤΡΕΩΣ 92 ΣΟΦΙΑ ΠΑΠΠΑ\r\n• DEXAMENES 22 ΠΑΠΑΔΙΑΜΑΝΤΟΠΟΥΛΟΥ 22 ΤΟΜΟΠΟΣΙΔΗΣ ΜΙΧΑΛΗΣ\r\n• ΠΕΙΝΑΚΟΘΗΚΗ ΣΤΑΥΡΟΠΟΥΛΟΥ 52 ΝΙΚΟΛΟΠΟΥΛΟΣ ΚΩΝΣΤΑΝΤΙΝΟΣ\r\n• TALKS ΥΨΗΛΩΝ ΑΛΩΝΙΩΝ 24 ΘΕΟΔΩΡΟΣ ΚΑΣΣΙΑΝΟΣ\r\n• PASSENGER DOWN TOWN ΠΛ.ΓΕΩΡΓΙΟΥ 1Α ΓΡΗΓΟΡΟΠΟΥΛΟΥ ΘΕΟΔΩΡΑ\r\n• VINO DIVINO ΠΛΑΤΕΙΑ ΒΟΡΕΙΟΥ ΗΠΕΙΡΟΥ ΓΙΑΝΝΗΣ ΚΑΡΤΣΑΝΗΣ\r\n• CHERRY’S ΠΛ.ΓΕΩΡΓΙΟΥ Α 27 ΤΣΕΡΗΣ ΑΘΑΝΑΣΙΟΣ\r\n• HEMINGWAY ΡΗΓΑ ΦΕΡΑΙΟΥ 98 ΜΠΟΥΡΔΟΠΟΥΛΟΣ ΚΩΝ/ΝΟΣ- ΜΑΚΚΑΣ\r\nΑΛΕΞΙΟΣ\r\n• ΠΥΛΗ ΚΑΦΕ SNACK BAR ΜΕΓ.ΑΛΕΞΑΝΔΡΟΥ&ΙΕΡΙΣΣΟΥ ΒΑΓΓΕΛΗΣ ΒΕΡΡΑΣ\r\n• Ι LOVE CAFE EΛΛ.ΣΤΡΑΤΙΩΤΟΥ 101 ΛΑΖΑΡΗ ΜΑΥΡΑ\r\n• ΤΑΜ ΤΟΟΜ ΕΛΕΥΘΕΡΙΑΣ ΚΑΙ 28ΗΣ ΟΚΤΩΒΡΙΟΥ ΜΑΤΑΘΑΙΟΠΟΥΛΟΣ ΤΑΚΗΣ\r\n• ΟΙ ΝΟΣΤΙΜΙΕΣ ΤΟΥ ΣΑΚΗ ΑΚΡΩΤΗΡΙΟΥ 91 ΣΑΚΗΣ ΤΣΙΓΓΑΝΟΣ\r\n• BLUE BLACK ΕΜΠΟΡΙΚΟ ΚΕΝΤΡΟ ΑΒ ΒΑΣΙΛΟΠΟΥΛΟΥ- ΝΈΟ ΜΠΑΛΤΖΗΣ ΗΛΙΑΣ\r\n• ΣΙΝΙΑΛΟ ΚΑΡΑΪΣΚΑΚΗ 68 ΣΠΥΡΟΣ ΣΑΛΜΟΥΚΑΣ\r\n• JUICE LAB ΕΛΛΗΝΟΣ ΣΤΡΑΤΙΩΤΟΥ 75 ΧΡΗΣΤΟΣ ΣΙΝΟΣ\r\n• Νότος Jazz Bar ΠΑΤΡΕΩΣ 80 ΦΛΑΜΙΑΤΟΣ ΧΑΡΑΛΑΜΠΟΣ\r\n• Root · The Vegetarian project ΚΟΛΟΚΟΤΡΩΝΗ 54 & ΚΑΝΑΚΑΡΗ ΣΙΟΥΡΤΟΣ\r\nΖΑΧΑΡΙΑΣ\r\n• AYA SUSHI NOODLES ΒΥΡΩΝΟΣ 1 ΨΗΛΟΠΑΝΑΓΙΩΤΗ ΠΕΝΝΥ\r\nΑναλυτικότερες πληροφορίες για τις ειδικές προσφορές ανά κατάστημα μπορείτε να δειτε\r\nστο: https://welcometoup.upatras.gr/sponsors/sales-and-promotions/taste-the-city-promo/\r\nΠληροφορίες για το Φεστιβάλ Υποδοχής Πρωτοετών Φοιτητών του Πανεπιστημίου Πατρών,\r\nθα τα βρείτε στην ηλεκτρονική διεύθυνση https://welcometoup.upatras.gr/\r\nTo Welcome to UP διοργανώνεται από το Πανεπιστήμιο Πατρών σε συνδιοργάνωση με\r\nτην Περιφέρεια Δυτικής Ελλάδας και το Επιμελητήριο Αχαΐας, σε συνεργασία με τους Δήμους\r\nΠατρέων, Αγρινίου και Μεσολογγίου και με την χρηματοδότηση του Υπουργείου Πολιτισμού.\r\nΗ ΔΕΗ είναι Χρυσός Χορηγός του Welcome to UP 2024, δίνοντας ενέργεια\r\nαποκλειστικά για φοιτητές και φουλ παροχές!Περισσότερα στο ΔΕΗ",
                CreatedTs = DateTime.Parse("2024-08-02 00:05:11.143000"),
                IsPublished = true,
                Creator = secretary,
                RelatedToCategories = new List<Category> { category1 },
                RelatedToSubjects = new List<Subject> { }
            };

            toAdd.Add(announcement1);
            toAdd.Add(announcement2);
            toAdd.Add(announcement3);
            toAdd.Add(announcement4);
            toAdd.Add(announcement5);
            toAdd.Add(announcement6);
            toAdd.Add(announcement7);
            toAdd.Add(announcement8);
            toAdd.Add(announcement9);
            toAdd.Add(announcement10);
            toAdd.Add(announcement11);
            toAdd.Add(announcement12);
            toAdd.Add(announcement13);
            toAdd.Add(announcement14);


            foreach (var item in toAdd)
            {
                _context.Add(item);
            }

            await _context.SaveChangesAsync();

            return true;
        }
    }

#endif
}
