using EFDataAccessLibrary.Data;
using Microsoft.EntityFrameworkCore;

public class MyDbContext : DbContext
{
    public DbSet<Announcement> Announcements { get; set; }
    protected override void OnConfiguring(DbContextOptionsBuilder optionsBuilder)
    {
        optionsBuilder.UseSqlServer("Server=localhost;User Id=root;Password=r00t;;Database=announcementapiVNext");
    }
}

class Program
{
    static async Task Main(string[] args)
    {
        using var context = new MyDbContext();

        // Ensure the database is created
        await context.Database.EnsureCreatedAsync();

        // Check if there are existing announcements
        if (!context.Announcements.Any())
        {
            // List of announcements to insert
            var announcements = new[]
            {
                new Announcement
                {
                    Id = 13,
                    Title = "Σχεδιασμός Συστημάτων Ειδικού Σκοπού: Έναρξη διαλέξεων",
                    Abstract = "Οι διαλέξεις του κατ’ επιλογήν μαθήματος “Σχεδιασμός Συστημάτων Ειδικού Σκοπού”, θα ξεκινήσουν την Πέμπτη 3/10.",
                    Body = "O κ. Βέργος είναι Διπλωματούχος και Διδάκτορας του Τμήματος Μηχανικών Η/Υ & Πληροφορικής του Πανεπιστημίου Πατρών. Στη διδακτορική του διατριβή πρότεινε τρεις εναλλακτικές τεχνικές αντιμετώπισης ελαττωμάτων στις ενσωματωμένες κρυφές μνήμες, κάποιες εκ των οποίων βρίσκουν εμπορική εφαρμογή στα ολοκληρωμένα μικροεπεξεργαστών έως και σήμερα. Ακολούθως εργάστηκε ως σχεδιαστής υλικού για την εταιρεία Atmel. Ήταν μέλος της σχεδιαστικής μονάδας του πρώτου παγκοσμίως επεξεργαστή που υλοποιούσε πλήρως το MAC επίπεδο ασύρματων δικτύων κατά το πρότυπο 802.11, ενώ εργάστηκε και στην ανάπυξη άλλων ολοκληρωμένων για δικτυακές εφαρμογές. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν τις αρχιτεκτονικές αριθμητικών κυκλωμάτων, τη σχεδίαση και έλεγχο ορθής λειτουργίας ολοκληρωμένων κυκλωμάτων, τη γρήγορη πρωτοτυποποίηση με χρήση ολοκληρωμένων προγραμματιζόμενης λογικής και τη σταδιακή υποβάθμιση της απόδοσης για την αντιμετώπιση σφαλμάτων. Σε αυτά τα αντικείμενα έχει δημοσιεύσει πάνω από 95 εργασίες, με τουλάχιστον 10 εξ αυτών στα απολύτως κορυφαία περιοδικά του χώρου, ενώ είναι συνεφευρέτης μιας ιδέας κατοχυρωμένης για εμπορική χρήση με πατέντα παγκοσμίου εμβέλειας. Είναι επίσης κριτής σε σχεδόν όλα τα φημισμένα περιοδικά και συνέδρια του χώρου και υψηλού κύρους μέλος της IEEE. Κατά το τρέχων ακαδημαϊκό έτος διδάσκει τα μαθήματα “Βασικές αρχές οργάνωσης και λειτουργίας υπολογιστικών συστημάτων” και “Σχεδίαση συστημάτων με χρήση υπολογιστών” του προπτυχιακού προγράμματος. Επίσης διδάσκει το μάθημα “Υπολογιστικά συστήματα υψηλής αξιοπιστίας” τόσο για προπτυχιακούς όσο και μεταπτυχιακούς φοιτητές. Στο παρελθόν έχει διδάξει μαθήματα Ψηφιακής Σχεδίασης, Ηλεκτρονικών και Αρχιτεκτονικής, ενώ ήταν ο επιβλέπων της ανάπτυξης του ΑΤ91, ενός συστήματος βασισμένου σε αρχιτεκτονική ARM που χρησιμοποιείται έως και σήμερα στα εργαστήρια συμβολικής γλώσσας και μικροϋπολογιστών. Είναι Δντής του εργαστηρίου Μικροηλεκτρονικής. Έχει διατελέσει επίσης Δντής του τομέα Υλικού και Αρχιτεκτονικής των Υπολογιστών και του Υπολογιστικού Κέντρου του Τμήματος.",
                    CreatedTs = DateTime.Parse("2024-02-19 02:50:12.119"),
                    
                    
                    //UserID = null
                },
                new Announcement
                {
                    Id = 15,
                    Title = "Παρουσίαση Διπλωματικής Εργασίας",
                    Abstract = "Την Παρασκευή 27/9/2024 στις 5:30, θα πραγματοποιηθεί η παρουσίαση της προπτυχιακής διπλωματικής εργασίας του φοιτητή κ. Γουρνιεζάκη Γεώργιου με τίτλο: «Ανάπτυξη πλατφόρμας χαρτογράφησης αιολικών πάρκων με μηχανισμό διαβούλευσης για τον εντοπισμό απειλών για τη βιοποικιλότητα». Η παρουσίαση θα γίνει με εξ’ αποστάσεως σύνδεση στο Zoom link: https://upatras-gr.zoom.us/j/91719033873?pwd=1G3HWtuzG6ylIA6HQYXTkPnngkYfd4.1 Meeting ID: 917 1903 3873 Passcode: 972395 Τριμελής...",
                    Body = "Την Παρασκευή 27/9/2024 στις 5:30, θα πραγματοποιηθεί η παρουσίαση της προπτυχιακής διπλωματικής εργασίας του φοιτητή κ. Γουρνιεζάκη Γεώργιου με τίτλο: “Ανάπτυξη πλατφόρμας χαρτογράφησης αιολικών πάρκων με μηχανισμό διαβούλευσης για τον εντοπισμό απειλών για τη βιοποικιλότητα”. Η παρουσίαση θα γίνει με εξ’ αποστάσεως σύνδεση στο Zoom link: https://upatras-gr.zoom.us/j/91719033873?pwd=1G3HWtuzG6ylIA6HQYXTkPnngkYfd4.1 Meeting ID: 917 1903 3873 Passcode: 972395 Τριμελής επιτροπή: ...",
                    CreatedTs = DateTime.Parse("2023-08-02 00:05:11.143"),
                    
                    
                    //UserID = null
                },
                new Announcement
                {
                    Id = 17,
                    Title = "Παρουσίαση Διπλωματικής Εργασίας, Γουρνιεζάκης Γιώργος",
                    Abstract = "Την Παρασκευή 27/9/2024 στις 5:30, θα πραγματοποιηθεί η παρουσίαση της προπτυχιακής διπλωματικής εργασίας του φοιτητή κ. Γουρνιεζάκη Γεώργιου με τίτλο:",
                    Body = "Την Παρασκευή 27/9/2024 στις 5:30, θα πραγματοποιηθεί η παρουσίαση της προπτυχιακής διπλωματικής εργασίας του φοιτητή κ. Γουρνιεζάκη Γεώργιου με τίτλο: “Ανάπτυξη πλατφόρμας χαρτογράφησης αιολικών πάρκων με μηχανισμό διαβούλευσης για τον εντοπισμό απειλών για τη βιοποικιλότητα”.",
                    CreatedTs = DateTime.Parse("2023-08-02 00:14:03.669"),
                    
                    
                    //UserID = null
                },
                new Announcement
                {
                    Id = 18,
                    Title = "Διπλωματικές 24-25 – Τσίχλας Κωνσταντίνος",
                    Abstract = "Aγαπητές/οί φοιτήτριες/τητές, Σε λίγες ημέρες θα ανακοινωθεί στον ιστό-τοπο του Τμήματος: Υποχρεωτικά Μαθήματα το Ωρολόγιο Πρόγραμμα και θα αρχίσουν οι εγγραφές στο μάθημα “Βασικά Ηλεκτρονικά (Εργαστήριο)” (Β’ Έτος). Προκειμένου να μπορέσετε να επιλέξετε Τμήμα Εξάσκησης, θα πρέπει, πρώτα, να εγγραφείτε στον ιστό-τοπο του μαθήματος: ΒΑΣΙΚΑ ΗΛΕΚΤΡΟΝΙΚΑ-ΕΡΓΑΣΤΗΡΙΟ (23165NY) (CEID1119) Στον ιστό-τοπο αυτόν θα βρείτε τις Σημειώσεις...",
                    Body = "Αγαπητές/οί φοιτήτριες/τητές, Σε λίγες ημέρες θα ανακοινωθεί στον ιστό-τοπο του Τμήματος: Υποχρεωτικά Μαθήματα το Ωρολόγιο Πρόγραμμα και θα αρχίσουν οι εγγραφές στο μάθημα “Βασικά Ηλεκτρονικά (Εργαστήριο)” (Β’ Έτος). Προκειμένου να μπορέσετε να επιλέξετε Τμήμα Εξάσκησης, θα πρέπει, πρώτα, να εγγραφείτε στον ιστό-τοπο του μαθήματος: ΒΑΣΙΚΑ ΗΛΕΚΤΡΟΝΙΚΑ-ΕΡΓΑΣΤΗΡΙΟ (23165NY) (CEID1119) Στον ιστό-τοπο αυτόν θα βρείτε τις Σημειώσεις των μαθημάτων (PowerPoint) και θα γίνεται σχετική αναφορά στους τόπους και τις ώρες διεξαγωγής τους. Στην ενότητα αυτή θα μπορείτε να κάνετε και ερωτήσεις σας και να συμμετάσχετε στις ψηφοφορίες (quiz) που θα αναρτώνται, ανά περίπτωση, εντός των εργαστηρίων. Με εκτίμηση, Τσίχλας Κωνσταντίνος",
                    CreatedTs = DateTime.Parse("2023-08-02 00:32:03.669"),
                    
                    
                    ////UserID = null
                },
                new Announcement
                {
                    Id = 19,
                    Title = "Διπλωματικές 23-24 – Πλουμιστός Βασίλειος",
                    Abstract = "Αγαπητές/οί φοιτήτριες/τητές, Στις 30/5/2024 και ώρα 18:00 θα πραγματοποιηθεί η παρουσίαση της διπλωματικής εργασίας του κ. Πλουμιστού Βασίλειου με τίτλο: “Ανάπτυξη υποδομών με σύγχρονα δεδομένα για τα ευφυή συστήματα”.",
                    Body = "Αγαπητές/οί φοιτήτριες/τητές, Στις 30/5/2024 και ώρα 18:00 θα πραγματοποιηθεί η παρουσίαση της διπλωματικής εργασίας του κ. Πλουμιστού Βασίλειου με τίτλο: “Ανάπτυξη υποδομών με σύγχρονα δεδομένα για τα ευφυή συστήματα”. Θα υπάρχει ζωντανή μετάδοση της παρουσίασης. Σας καλούμε να παρακολουθήσετε και να συμμετάσχετε στη διαδικασία με ερωτήσεις και παρατηρήσεις. Με εκτίμηση, Ο επιβλέπων καθηγητής, Κ. Κωνσταντίνου.",
                    CreatedTs = DateTime.Parse("2023-08-02 00:50:12.119"),
                    
                    
                    //UserID = null
                },
                new Announcement
                {
                    Id = 22,
                    Title = "Εξετάσεις Μαθημάτων – Δηλώσεις Εξεταστικής",
                    Abstract = "Σας ενημερώνουμε ότι η περίοδος δήλωσης εξετάσεων για το χειμερινό εξάμηνο 2023-2024 θα διαρκέσει από 1 έως 15 Δεκεμβρίου 2023.",
                    Body = "Αγαπητές/οί φοιτήτριες/τητές, Σας ενημερώνουμε ότι η περίοδος δήλωσης εξετάσεων για το χειμερινό εξάμηνο 2023-2024 θα διαρκέσει από 1 έως 15 Δεκεμβρίου 2023. Οι δηλώσεις εξετάσεων θα γίνουν μέσω του ιστότοπου του Τμήματος. Παρακαλείστε να ελέγξετε το ωρολόγιο πρόγραμμα και να δηλώσετε τα μαθήματα σύμφωνα με τις οδηγίες που θα αναρτηθούν. Για οποιαδήποτε απορία ή πρόβλημα, μπορείτε να απευθυνθείτε στο γραφείο σπουδών.",
                    CreatedTs = DateTime.Parse("2023-08-02 01:10:12.119"),
                    
                    
                    //UserID = null
                },
                new Announcement
                {
                    Id = 24,
                    Title = "Προκήρυξη Υποτροφιών 2024-2025",
                    Abstract = "Το Εκκλησιαστικό Ίδρυμα προκηρύσσει υποτροφίες για το ακαδημαϊκό έτος 2024-2025. Οι ενδιαφερόμενοι μπορούν να υποβάλουν τις αιτήσεις τους μέχρι 30 Ιουνίου 2024.",
                    Body = "Το Εκκλησιαστικό Ίδρυμα προκηρύσσει υποτροφίες για το ακαδημαϊκό έτος 2024-2025. Οι ενδιαφερόμενοι μπορούν να υποβάλουν τις αιτήσεις τους μέχρι 30 Ιουνίου 2024. Οι υποτροφίες αφορούν φοιτητές που πληρούν συγκεκριμένα κριτήρια, τα οποία περιγράφονται αναλυτικά στην ιστοσελίδα του ιδρύματος. Για πληροφορίες μπορείτε να επικοινωνήσετε με το γραφείο υποτροφιών.",
                    CreatedTs = DateTime.Parse("2023-08-02 13:11:31.791"),
                    
                    
                    //UserID = null
                }
            };

            //context.Announcements.Add(announcement);
            }

            await context.SaveChangesAsync();
            Console.WriteLine("Dummy data inserted!");
        }
    }

